Белгипрозем_2017/src/InformationRegisters/НеполученныеВходящиеПисьма/НеполученныеВходящиеПисьма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НеполученныеВходящиеПисьма</name>
  <resources>
    <name>ОтсталосьПопытокПолучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/НеполученныеВходящиеПисьма/ManagerModule.bsl
// Удаляет из регистра запись об не полученном входящем письме.
// Вызывается при успешном получении письма или если письмо отсутствует в почтовом ящике.
//
Процедура УдалитьСведенияОПисьме(УчетнаяЗапись, Идентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.НеПолученныеВходящиеПисьма.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.Идентификатор = Идентификатор;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Добавляет в регистр запись об не полученном вхоящем письме,
// если запись уже есть, то уменьшает оставщееся количество
// попыток получения.
Процедура НеуспешнаяПопыткаПолучения(УчетнаяЗапись, Идентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.НеПолученныеВходящиеПисьма.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.Идентификатор = Идентификатор;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Запись.УчетнаяЗапись = УчетнаяЗапись;
		Запись.Идентификатор = Идентификатор;
		Запись.ОтсталосьПопытокПолучения = 3;
	КонецЕсли;
	
	Запись.ОтсталосьПопытокПолучения = Запись.ОтсталосьПопытокПолучения - 1;
	Запись.Записать(Истина);
	
КонецПроцедуры
